{
  "nodes": [
    {
      "op": "null", 
      "name": "ngram_features-64u1FFOQ3m", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-IN7oavT9V5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-IN7oavT9V5_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-IN7oavT9V5_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "numerical_features-IN7oavT9V5_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "numerical_features-IN7oavT9V5_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat35", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[0, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_Duration_of_pain_weight", 
      "attrs": {"num_hidden": "11"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_Duration_of_pain_bias", 
      "attrs": {"num_hidden": "11"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_Duration_of_pain", 
      "attrs": {"num_hidden": "11"}, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax20", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Duration_of_pain", 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar40", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar75", 
      "attrs": {"scalar": "11"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser20", 
      "inputs": [[11, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul60", 
      "inputs": [[11, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split20", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "pick", 
      "name": "pick40", 
      "inputs": [[10, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar41", 
      "attrs": {"scalar": "-1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like20", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater20", 
      "inputs": [[16, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul61", 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "__empirical_risk_instance_weight__", 
      "inputs": []
    }, 
    {
      "op": "pick", 
      "name": "pick41", 
      "inputs": [[22, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul62", 
      "inputs": [[21, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum55", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar76", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div55", 
      "inputs": [[24, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like20", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum56", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul55", 
      "inputs": [[27, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean35", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar77", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div56", 
      "inputs": [[30, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum71", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar71", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum70", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar70", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul56", 
      "inputs": [[35, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss35", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax20", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-Duration_of_pain", 
      "inputs": [[40, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 3, 7, 8, 11, 22], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42
  ], 
  "heads": [[39, 0, 0], [41, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10800]}
}